[
    {
        "id": 1,
        "titulo": "Equipe de Backend",
        "descricao": "Focada em resolver desafios de arquitetura, performance e segurança no lado do servidor. Junte-se para construir APIs resilientes e otimizar bancos de dados.",
        "imagem": "https://picsum.photos/seed/backend_team/600/400",
        "conteudo": "A Equipe de Backend é o ponto de encontro para desenvolvedores que amam resolver problemas complexos de lógica de servidor. Aqui, colaboramos em projetos que exigem arquiteturas de microsserviços, otimização de queries em bancos de dados e implementação de sistemas de autenticação seguros. Se você tem um desafio de backend ou quer ajudar a resolver um, este é o seu lugar.",
        "responsavel": "Alex Lima",
        "data_inicio": "2024-01-10"
    },
    {
        "id": 2,
        "titulo": "Equipe de Frontend",
        "descricao": "Apaixonados por interfaces e experiência do usuário. Colabore para resolver problemas de componentização, estado e performance em aplicações web.",
        "imagem": "https://picsum.photos/seed/frontend_team/600/400",
        "conteudo": "Na Equipe de Frontend, nosso foco é transformar designs complexos em interfaces rápidas, acessíveis e intuitivas. Enfrentamos desafios como gerenciamento de estado em larga escala (state management), otimização do tempo de carregamento (load time) e criação de bibliotecas de componentes reutilizáveis. Traga seu bug de CSS ou seu desafio de lógica em JavaScript e vamos resolver juntos.",
        "responsavel": "Bruna Costa",
        "data_inicio": "2024-02-15"
    },
    {
        "id": 3,
        "titulo": "Equipe de Infra & DevOps",
        "descricao": "Especialistas em automação, cloud e CI/CD. Junte-se para resolver desafios de deploy, escalabilidade e monitoramento de aplicações.",
        "imagem": "https://picsum.photos/seed/devops_team/600/400",
        "conteudo": "A Equipe de Infra & DevOps é para aqueles que gostam de fazer a 'mágica' acontecer por trás dos panos. Nosso objetivo é automatizar tudo, desde o build e o teste até o deploy em produção. Colaboramos para resolver problemas com contêineres Docker, orquestração com Kubernetes e configuração de pipelines de CI/CD eficientes na nuvem. Se sua aplicação não escala ou o deploy está lento, a solução começa aqui.",
        "responsavel": "Carlos Souza",
        "data_inicio": "2024-03-20"
    }
]